; domain
;; Adapted from: https://github.com/josej30/Planner-Sat-Constraints
;; We use existential preconditions (exists) to remove as many parameters from the actions as possible

(define (domain logistics)

(:requirements :strips :typing :existential-preconditions) 

(:types  city location thing - object
         package vehicle - thing
         truck airplane - vehicle  
         airport - location)
  
(:predicates  (in-city ?l - location ?c - city)
              (at ?obj - thing ?l - location)
              (in ?p - package ?veh - vehicle))
  
(:action drive
         :parameters    (?t - truck ?from ?to - location)
         :precondition  (and 
                             (at ?t ?from)
                             (exists (?c - city)
                                (and (in-city ?from ?c) (in-city ?to ?c))
                              )
                         )
         :effect        (and (not (at ?t ?from))
                             (at ?t ?to)))

(:action fly
         :parameters    (?a - airplane ?from ?to - airport)
         :precondition  (at ?a ?from)
         :effect        (and (not (at ?a ?from))
                             (at ?a ?to)))

(:action load
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (at ?p ?l))
         :effect        (and (not (at ?p ?l))
                             (in ?p ?v)))

(:action unload
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (in ?p ?v))
         :effect        (and (not (in ?p ?v))
                             (at ?p ?l)))

)

; problem
(define (problem problem_6)

(:domain logistics)

(:objects
	obj0 obj2 - airport
	obj1 obj3 - city
	obj4 obj5 - truck
	obj6 obj7 obj9 obj15 obj16 - package
	obj8 obj10 obj11 obj13 obj14 - location
	obj12 - airplane
)

(:init
	(at obj4 obj0)
	(at obj5 obj2)
	(at obj6 obj2)
	(at obj7 obj0)
	(at obj9 obj2)
	(at obj12 obj2)
	(at obj15 obj10)
	(at obj16 obj11)
	(in-city obj0 obj1)
	(in-city obj2 obj3)
	(in-city obj8 obj1)
	(in-city obj10 obj3)
	(in-city obj11 obj1)
	(in-city obj13 obj1)
	(in-city obj14 obj1)
)

(:goal (and
	(at obj6 obj13)
	(at obj7 obj10)
	(at obj9 obj11)
	(at obj16 obj8)
))
)

; plan
1. (drive obj4 obj0 obj11)
   deleted: (at obj4 obj0)
   added: (at obj4 obj11)
   goals met: 0 of 4
2. (load obj12 obj6 obj2)
   deleted: (at obj6 obj2)
   added: (in obj6 obj12)
   goals met: 0 of 4
3. (load obj12 obj9 obj2)
   deleted: (at obj9 obj2)
   added: (in obj9 obj12)
   goals met: 0 of 4
4. (fly obj12 obj2 obj0)
   deleted: (at obj12 obj2)
   added: (at obj12 obj0)
   goals met: 0 of 4
5. (load obj4 obj16 obj11)
   deleted: (at obj16 obj11)
   added: (in obj16 obj4)
   goals met: 0 of 4
6. (unload obj12 obj6 obj0)
   deleted: (in obj6 obj12)
   added: (at obj6 obj0)
   goals met: 0 of 4
7. (unload obj12 obj9 obj0)
   deleted: (in obj9 obj12)
   added: (at obj9 obj0)
   goals met: 0 of 4
8. (drive obj4 obj11 obj8)
   deleted: (at obj4 obj11)
   added: (at obj4 obj8)
   goals met: 0 of 4
9. (fly obj12 obj0 obj2)
   deleted: (at obj12 obj0)
   added: (at obj12 obj2)
   goals met: 0 of 4
10. (unload obj4 obj16 obj8)
   deleted: (in obj16 obj4)
   added: (at obj16 obj8)
   goals met: 1 of 4
11. (drive obj4 obj8 obj0)
   deleted: (at obj4 obj8)
   added: (at obj4 obj0)
   goals met: 1 of 4
12. (drive obj4 obj0 obj11)
   deleted: (at obj4 obj0)
   added: (at obj4 obj11)
   goals met: 1 of 4
13. (fly obj12 obj2 obj0)
   deleted: (at obj12 obj2)
   added: (at obj12 obj0)
   goals met: 1 of 4
14. (drive obj4 obj11 obj8)
   deleted: (at obj4 obj11)
   added: (at obj4 obj8)
   goals met: 1 of 4
15. (drive obj5 obj2 obj10)
   deleted: (at obj5 obj2)
   added: (at obj5 obj10)
   goals met: 1 of 4
16. (fly obj12 obj0 obj2)
   deleted: (at obj12 obj0)
   added: (at obj12 obj2)
   goals met: 1 of 4
17. (drive obj4 obj8 obj0)
   deleted: (at obj4 obj8)
   added: (at obj4 obj0)
   goals met: 1 of 4
18. (fly obj12 obj2 obj0)
   deleted: (at obj12 obj2)
   added: (at obj12 obj0)
   goals met: 1 of 4
19. (load obj12 obj7 obj0)
   deleted: (at obj7 obj0)
   added: (in obj7 obj12)
   goals met: 1 of 4
20. (fly obj12 obj0 obj2)
   deleted: (at obj12 obj0)
   added: (at obj12 obj2)
   goals met: 1 of 4
21. (drive obj5 obj10 obj2)
   deleted: (at obj5 obj10)
   added: (at obj5 obj2)
   goals met: 1 of 4
22. (load obj4 obj6 obj0)
   deleted: (at obj6 obj0)
   added: (in obj6 obj4)
   goals met: 1 of 4
23. (load obj4 obj9 obj0)
   deleted: (at obj9 obj0)
   added: (in obj9 obj4)
   goals met: 1 of 4
24. (unload obj12 obj7 obj2)
   deleted: (in obj7 obj12)
   added: (at obj7 obj2)
   goals met: 1 of 4
25. (drive obj4 obj0 obj11)
   deleted: (at obj4 obj0)
   added: (at obj4 obj11)
   goals met: 1 of 4
26. (load obj5 obj7 obj2)
   deleted: (at obj7 obj2)
   added: (in obj7 obj5)
   goals met: 1 of 4
27. (unload obj4 obj9 obj11)
   deleted: (in obj9 obj4)
   added: (at obj9 obj11)
   goals met: 2 of 4
28. (drive obj4 obj11 obj13)
   deleted: (at obj4 obj11)
   added: (at obj4 obj13)
   goals met: 2 of 4
29. (drive obj5 obj2 obj10)
   deleted: (at obj5 obj2)
   added: (at obj5 obj10)
   goals met: 2 of 4
30. (unload obj4 obj6 obj13)
   deleted: (in obj6 obj4)
   added: (at obj6 obj13)
   goals met: 3 of 4
31. (unload obj5 obj7 obj10)
   deleted: (in obj7 obj5)
   added: (at obj7 obj10)
   goals met: 4 of 4
